# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами.
# Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# Пример:

# Ввод:  пара-ра-рам рам-пам-папам па-ра-па-па
# Вывод: Парам пам-пам

song = input('Введите стихотворение:')
volwes = ['а', 'о', 'э', 'е', 'и', 'ы', 'у', 'ё', 'ю', 'я']
list_1 = song.split()
# print(list_1)
itog = list()
for part in list_1:
    # print(part)
    k = 0
    for letter in part:
        if letter in volwes:
            k += 1
    itog.append(k)
# print(itog)
if len(set(itog)) == 1:
    print('Парам пам-пам')
else:
    print('Пам парам')
