# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. 
# m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.
n = int(input('Введите количество элементов 1-го набора: '))
num_1 = set()
num_2 = set()
for _ in range(n):
    num_1.update(input('Введите элемент множества: '))
m = int(input('Введите количество элементов 2-го набора: '))
for _ in range(m):
    num_2.update(input('Введите элемент множества: '))
print(sorted(num_1 & num_2))