# На столе лежат n монеток. 
# Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть
# 5 -> 1 0 1 1 0
# 2


import random
from random import randint

amount_coin = int(input('введите количество монет: '))

m = 0
k = 0
coins = ['О', 'р']
for i in range(amount_coin):
    random.shuffle(coins)
    print(f' монета{coins}')
    if coins[0] == 'О':
        k += 1
    if coins[0] == 'р':
        m += 1
print(f'всего монет {m, k}')

if m > k:
    ans = k
else:
    ans = m

print(f"минимальное количество монет, которые нужно перевернуть{ans}")

