# Задача 30:  
# Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
def get_ar_prog(A, B, C: int) -> list[int]:
    list_1 = []
    for i in range(n):
        list_1.append(A + i * B)
        print(list_1[i])


a1 = int(input('Введите первый элемент: '))
d = int(input('Введите разность арифметической прогрессии: '))
n = int(input('Введите количество элементов: '))
get_ar_prog(a1, d, n)